#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_container_app.nginx has been deleted
  - resource "azurerm_container_app" "nginx" {
        id                            = "/subscriptions/d3d5bc49-056b-4e36-83d4-44309a0e7ace/resourceGroups/rg-fb-sbx-uks-36a05f7c/providers/Microsoft.App/containerApps/ca-nginx"
        name                          = "ca-nginx"
        tags                          = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "nginx"
        }
        # (9 unchanged attributes hidden)

      - ingress {
          - fqdn                       = "ca-nginx.ashycoast-f1317a17.uksouth.azurecontainerapps.io" -> null
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = "/subscriptions/d3d5bc49-056b-4e36-83d4-44309a0e7ace/resourceGroups/rg-fb-sbx-uks-36a05f7c/providers/Microsoft.App/managedEnvironments/cae-fb-sbx-uks-36a05f7c"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-nginx"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-36a05f7c"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "nginx"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:latest"
              + memory            = "2Gi"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.redis will be created
  + resource "azurerm_container_app" "redis" {
      + container_app_environment_id  = "/subscriptions/d3d5bc49-056b-4e36-83d4-44309a0e7ace/resourceGroups/rg-fb-sbx-uks-36a05f7c/providers/Microsoft.App/managedEnvironments/cae-fb-sbx-uks-36a05f7c"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-redis"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-36a05f7c"
      + revision_mode                 = "Single"
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 6379
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 6379
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "redis:latest"
              + memory            = "2Gi"
              + name              = "redis"
            }
        }
    }

  # azurerm_subnet.pe will be created
  + resource "azurerm_subnet" "pe" {
      + address_prefixes                               = [
          + "192.168.8.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "pe"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-fb-sbx-uks-36a05f7c"
      + virtual_network_name                           = "vnet-fb-sbx-uks-36a05f7c"
    }

  # azurerm_subnet.redis will be created
  + resource "azurerm_subnet" "redis" {
      + address_prefixes                               = [
          + "192.168.10.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "redis"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-fb-sbx-uks-36a05f7c"
      + virtual_network_name                           = "vnet-fb-sbx-uks-36a05f7c"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ingress = (known after apply)

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure